# 데이터 분석 프로그래밍 따라하기, 청소년 인터넷 사용시간 통계 분석

### pandas 불러오기
* import 모듈명 as 별칭

In [100]:
import pandas as pd

### 데이터 읽어오기
* .read_excel("파일경로 및 파일명")
* .read_scv("파일경로 및 파일명")

In [101]:
pd.read_excel("./data/internet.xls")

,기간,구분,학습목적 이외 인터넷 사용시간,학습목적 이외 인터넷 사용시간.1,학습목적 이외 인터넷 사용시간.2,학습목적 이외 인터넷 사용시간.3,학습목적 이외 인터넷 사용시간.4,학습목적 이외 인터넷 사용시간.5
0,기간,구분,주중,주중,주중,주말,주말,주말
1,기간,구분,전체,남학생,여학생,전체,남학생,여학생
2,2018,구분,120.4,115.1,126,172.5,169.6,175.5

### heaedr 옵션으로 행 지정하기

In [102]:
pd.read_excel("./data/internet.xls", header = 1)

     기간  구분      주중   주중.1 주중.2     주말   주말.1   주말.2
0    기간  구분      전체    남학생  여학생     전체    남학생    여학생
1  2018   구분  120.4  115.1  126  172.5  169.6  175.5

In [103]:
pd.read_excel("./data/internet.xls", header = 2)

     기간 구분      전체    남학생  여학생   전체.1  남학생.1  여학생.1
0  2018  구분  120.4  115.1  126  172.5  169.6  175.5

### usecols 옵션으로 사용할 열 선택하기

In [104]:
pd.read_excel("./data/internet.xls", header = 2, usecols ="A,B,C")

     기간 구분      전체
0  2018  구분  120.4

In [105]:
pd.read_excel("./data/internet.xls", header = 2, usecols ="C,F")

      전체   전체.1
0  120.4  172.5

In [106]:
pd.read_excel("./data/internet.xls", header = 2, usecols ="C:E")

      전체    남학생  여학생
0  120.4  115.1  126

### names 옵션으로 제목(컬럼명) 변경하기

In [107]:
pd.read_excel("./data/internet.xls", header = 2, usecols = "C:E", names = ['주중전체','주중_남','주중_여'])

    주중전체   주중_남  주중_여
0  120.4  115.1   126

In [108]:
pd.read_excel("./data/internet.xls", 
              header = 2,
              usecols = "C:E", 
              names = ['주중전체','주중_남','주중_여'])

    주중전체   주중_남  주중_여
0  120.4  115.1   126

In [109]:
col_names = ['주중전체','주중_남','주중_여']
df_data = pd.read_excel("./data/internet.xls", 
              header = 2,
              usecols = "C:E", 
              names = col_names)

In [110]:
df_data

    주중전체   주중_남  주중_여
0  120.4  115.1   126

### 행 추가하기 (시간단위 추가)

In [111]:
df_data.loc[1] = df_data.loc[0] / 60

In [93]:
df_data

         주중전체        주중_남   주중_여
0  120.400000  115.100000  126.0
1    2.006667    1.918333    2.1

### 컬럼 추가하기

In [114]:
df_data['구분'] = ['분','시간']

In [115]:
df_data

         주중전체        주중_남   주중_여  구분
0  120.400000  115.100000  126.0   분
1    2.006667    1.918333    2.1  시간

### 인덱스 변경하기

df_data.set_index('구분')

In [117]:
df_data

         주중전체        주중_남   주중_여  구분
0  120.400000  115.100000  126.0   분
1    2.006667    1.918333    2.1  시간

### 실제로 저장하기

In [118]:
df_data.set_index('구분', inplace=True)

In [119]:
df_data

          주중전체        주중_남   주중_여
구분
분   120.400000  115.100000  126.0
시간    2.006667    1.918333    2.1